---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairsRailingShape
source: html/ff007b27-8690-1fae-8dbb-2f3ecc6d6149.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairsRailingShape Property

"Rail Shape"

## Syntax (C#)
```csharp
public static ForgeTypeId StairsRailingShape { get; }
```